app/controllers/articles_controller.rb

  def update
    #@article = Article.find(params[:id])
    @article.update(title: params[:article][:title], description: params[:article][:description])
---
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2020-08-09 00:40:56.175114"], ["id", 1]]